In [1]:
import pandas as pd

articulos_file = "../datalake/Articulos.csv"  
clientes_file = "../datalake/Clientes.csv"  
factura_file = "../datalake/Factura.csv"  
factura_detalle_file = "../datalake/FacturaDetalle.csv"  
unidad_medida_file = "../datalake/UnidadMedida.csv"  

articulos_df = pd.read_csv(articulos_file)
clientes_df = pd.read_csv(clientes_file)
factura_df = pd.read_csv(factura_file)
factura_detalle_df = pd.read_csv(factura_detalle_file)
unidad_medida_df = pd.read_csv(unidad_medida_file)

# Articulos

In [2]:
articulos_df.head()

,Codigo,UM,Descripcion1,Actual,Precio01,Precio02,Precio03,Estado
0,1,Uni,MANTECA ILOLAY X 200 GRS,-5925.0,865.0,908.25,821.75,ACTIVE
1,2,Uni,MANTECA ILOLAY X 100 GRS,-26281.0,445.0,467.25,422.75,ACTIVE
2,3,Uni,MANTECA X 100 GRS,-5796.0,347.0,364.35,329.65,ACTIVE
3,4,Uni,MANTECA,0.0,0.0,0.00,0.00,INACTIVE
4,755,Uni,DULCE DE LECHE ILOLAY X 200 GRS,-466562.0,445.0,467.25,422.75,ACTIVE

In [3]:
articulos_df.columns

Index(['Codigo', 'UM', 'Descripcion1', 'Actual', 'Precio01', 'Precio02',
       'Precio03', 'Estado'],
      dtype='object')

In [4]:
articulos_df.describe()

             Codigo         Actual     Precio01      Precio02     Precio03
count     315.00000     315.000000   315.000000    315.000000   315.000000
mean      479.08254   -6889.831479   357.754984    378.380902   342.339244
std      5630.59662   47031.941345  1003.693673   1054.014722   953.634124
min         1.00000 -668664.000000     0.000000      0.000000     0.000000
25%        82.50000   -1551.000000    13.500000     14.360000    12.990000
50%       161.00000    -121.000000    63.000000     66.150000    59.850000
75%       239.50000     -20.000000   298.100000    313.690000   283.815000
max    100080.00000       0.000000  9999.000000  10498.950000  9499.050000

In [5]:
articulos_df.shape

(315, 8)

In [6]:
articulos_df.dtypes

Codigo            int64
UM               object
Descripcion1     object
Actual          float64
Precio01        float64
Precio02        float64
Precio03        float64
Estado           object
dtype: object

In [7]:
articulos_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 315 entries, 0 to 314
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Codigo        315 non-null    int64
 1   UM            315 non-null    object
 2   Descripcion1  315 non-null    object
 3   Actual        315 non-null    float64
 4   Precio01      315 non-null    float64
 5   Precio02      315 non-null    float64
 6   Precio03      315 non-null    float64
 7   Estado        315 non-null    object
dtypes: float64(4), int64(1), object(3)
memory usage: 19.8+ KB

In [8]:
articulos_df.isnull().sum()

Codigo          0
UM              0
Descripcion1    0
Actual          0
Precio01        0
Precio02        0
Precio03        0
Estado          0
dtype: int64

# UnidadMedida

In [9]:
unidad_medida_df.head()

   IdUM   UM  Decimales      Obs  Estado  FechaHora  Usuario  Linked
0    11  Uni          0  unidad.       1        NaN        0       0
1    12   Kg          3      NaN       1        NaN        0       0
2    13  Grs          3      NaN       1        NaN        0       0

In [10]:
unidad_medida_df.columns

Index(['IdUM', 'UM', 'Decimales', 'Obs', 'Estado', 'FechaHora', 'Usuario',
       'Linked'],
      dtype='object')

In [11]:
unidad_medida_df.describe()

       IdUM  Decimales  Estado  FechaHora  Usuario  Linked
count   3.0   3.000000     3.0        0.0      3.0     3.0
mean   12.0   2.000000     1.0        NaN      0.0     0.0
std     1.0   1.732051     0.0        NaN      0.0     0.0
min    11.0   0.000000     1.0        NaN      0.0     0.0
25%    11.5   1.500000     1.0        NaN      0.0     0.0
50%    12.0   3.000000     1.0        NaN      0.0     0.0
75%    12.5   3.000000     1.0        NaN      0.0     0.0
max    13.0   3.000000     1.0        NaN      0.0     0.0

In [12]:
unidad_medida_df.shape

(3, 8)

In [13]:
unidad_medida_df.dtypes

IdUM           int64
UM            object
Decimales      int64
Obs           object
Estado         int64
FechaHora    float64
Usuario        int64
Linked         int64
dtype: object

In [14]:
unidad_medida_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   IdUM       3 non-null      int64
 1   UM         3 non-null      object
 2   Decimales  3 non-null      int64
 3   Obs        1 non-null      object
 4   Estado     3 non-null      int64
 5   FechaHora  0 non-null      float64
 6   Usuario    3 non-null      int64
 7   Linked     3 non-null      int64
dtypes: float64(1), int64(5), object(2)
memory usage: 324.0+ bytes

In [15]:
unidad_medida_df.isnull().sum()

IdUM         0
UM           0
Decimales    0
Obs          2
Estado       0
FechaHora    3
Usuario      0
Linked       0
dtype: int64

# Clientes

In [16]:
clientes_df.head()

   Cod_Cliente         Razon_Social    Estado
0            1   A CONSUMIDOR FINAL    ACTIVE
1            2        AGUIRRE, ELVA  INACTIVE
2            3     GANDUGLIA RAMONA    ACTIVE
3            4              ALMIRON    ACTIVE
4            5  AVILA, RAQUEL Z. DE  INACTIVE

In [17]:
clientes_df.columns

Index(['Cod_Cliente', 'Razon_Social', 'Estado'], dtype='object')

In [18]:
clientes_df.describe()

       Cod_Cliente
count   144.000000
mean     72.500000
std      41.713307
min       1.000000
25%      36.750000
50%      72.500000
75%     108.250000
max     144.000000

In [19]:
clientes_df.shape

(144, 3)

In [20]:
clientes_df.dtypes

Cod_Cliente      int64
Razon_Social    object
Estado          object
dtype: object

In [21]:
clientes_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 144 entries, 0 to 143
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Cod_Cliente   144 non-null    int64
 1   Razon_Social  144 non-null    object
 2   Estado        144 non-null    object
dtypes: int64(1), object(2)
memory usage: 3.5+ KB

In [22]:
clientes_df.isnull().sum()

Cod_Cliente     0
Razon_Social    0
Estado          0
dtype: int64

# Factura

In [23]:
factura_df.head()

   IdFactura  NroDoc       FechaFactura  IdCliente   Total  Estado
0          1       1  08/20/11 00:00:00         40  104.04  ACTIVE
1          2       2  08/20/11 00:00:00         49  225.12  ACTIVE
2          3       3  08/20/11 00:00:00          6  162.60  ACTIVE
3          4       4  08/20/11 00:00:00         37  119.05  ACTIVE
4          5       5  08/20/11 00:00:00         50   72.47  ACTIVE

In [24]:
factura_df.columns

Index(['IdFactura', 'NroDoc', 'FechaFactura', 'IdCliente', 'Total', 'Estado'], dtype='object')

In [25]:
factura_df.describe()

          IdFactura        NroDoc     IdCliente         Total
count  30596.000000  30596.000000  30596.000000  3.059600e+04
mean   15301.780461  15298.500000     49.246111  4.988285e+03
std     8835.501626   8832.448754     35.722135  3.164666e+05
min        1.000000      1.000000      1.000000  0.000000e+00
25%     7650.750000   7649.750000     20.000000  2.570575e+02
50%    15299.500000  15298.500000     38.000000  5.586700e+02
75%    22948.250000  22947.250000     77.000000  1.327557e+03
max    30607.000000  30596.000000    144.000000  3.944797e+07

In [26]:
factura_df.shape

(30596, 6)

In [27]:
factura_df.dtypes

IdFactura         int64
NroDoc            int64
FechaFactura     object
IdCliente         int64
Total           float64
Estado           object
dtype: object

In [28]:
factura_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30596 entries, 0 to 30595
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   IdFactura     30596 non-null  int64
 1   NroDoc        30596 non-null  int64
 2   FechaFactura  30596 non-null  object
 3   IdCliente     30596 non-null  int64
 4   Total         30596 non-null  float64
 5   Estado        30596 non-null  object
dtypes: float64(1), int64(3), object(2)
memory usage: 1.4+ MB

In [29]:
factura_df.isnull().sum()

IdFactura       0
NroDoc          0
FechaFactura    0
IdCliente       0
Total           0
Estado          0
dtype: int64

# FacturaDetalle

In [30]:
factura_detalle_df.head()

,IdFacturaDetalle,NroDoc,Codigo,Descripcion,Bulto,UM,Cantidad,PU,Bonif,Importe
0,1,1,38,LECHE DESCREMADA LARGA VIDA ILOLAY X 1 LT,12.0,Uni,12.0,4.3,0.0,51.60
1,2,1,19,QUESO CREMOSO CREMIGAL,0.0,Kg,1.9,27.6,0.0,52.44
2,3,2,38,LECHE DESCREMADA LARGA VIDA ILOLAY X 1 LT,6.0,Uni,6.0,4.3,0.0,25.80
3,4,2,93,CALDO X 6 WILDE,12.0,Uni,12.0,2.5,0.0,30.00
4,5,2,6,DULCE DE LECHE ILOLAY X 400 GRS,2.0,Uni,2.0,6.1,0.0,12.20

In [31]:
factura_detalle_df.columns

Index(['IdFacturaDetalle', 'NroDoc', 'Codigo', 'Descripcion', 'Bulto', 'UM',
       'Cantidad', 'PU', 'Bonif', 'Importe'],
      dtype='object')

In [32]:
factura_detalle_df.describe()

,IdFacturaDetalle,NroDoc,Codigo,Bulto,Cantidad,PU,Bonif,Importe
count,154115.000000,154115.000000,154115.000000,154115.000000,154115.000000,154115.000000,154115.000000,154115.000000
mean,86507.161431,13741.509723,352.178698,4.961553,6.619840,66.905015,0.156260,288.881962
std,51740.687345,8528.864709,5177.804202,6.021190,6.446784,435.562145,3.603091,1303.702818
min,1.000000,1.000000,1.000000,0.000000,0.350000,0.000000,0.000000,0.000000
25%,41834.500000,6328.000000,16.000000,1.000000,3.000000,6.800000,0.000000,34.900000
50%,84748.000000,13310.000000,38.000000,4.000000,5.000000,15.350000,0.000000,80.810000
75%,129251.500000,20639.000000,66.000000,6.000000,8.000000,51.500000,0.000000,213.300000
max,180964.000000,30586.000000,100080.000000,247.000000,99.000000,155555.000000,100.000000,233640.000000

In [33]:
factura_detalle_df.shape

(154115, 10)

In [34]:
factura_detalle_df.dtypes

IdFacturaDetalle      int64
NroDoc                int64
Codigo                int64
Descripcion          object
Bulto               float64
UM                   object
Cantidad            float64
PU                  float64
Bonif               float64
Importe             float64
dtype: object

In [35]:
factura_detalle_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 154115 entries, 0 to 154114
Data columns (total 10 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   IdFacturaDetalle  154115 non-null  int64
 1   NroDoc            154115 non-null  int64
 2   Codigo            154115 non-null  int64
 3   Descripcion       154115 non-null  object
 4   Bulto             154115 non-null  float64
 5   UM                154115 non-null  object
 6   Cantidad          154115 non-null  float64
 7   PU                154115 non-null  float64
 8   Bonif             154115 non-null  float64
 9   Importe           154115 non-null  float64
dtypes: float64(5), int64(3), object(2)
memory usage: 11.8+ MB

In [36]:
factura_detalle_df.isnull().sum()

IdFacturaDetalle    0
NroDoc              0
Codigo              0
Descripcion         0
Bulto               0
UM                  0
Cantidad            0
PU                  0
Bonif               0
Importe             0
dtype: int64